[
  {
    "file": "experiments/mountains.js",
    "name": "Waves 1.0",
    "description": "This artwork uses Perlin noise to create multiple waves with color gradient in between."
  },

  {
    "file": "experiments/mountains-var1.js",
    "name": "Waves 2.0",
    "description": "For this work, I took the same idea with waves but decided to add more depth by adding multiple overlapping layers with decreasing opacity to create a sense of depth."
  },

  {
    "file": "experiments/mountains-var2.js",
    "name": "The Sound 3.0",
    "description": "I continued experimenting with waves and this time added motion to the art piece. I wanted to immitate the sound waves that move as the sound changes."
  },

  {
    "file": "experiments/rect.js",
    "name": "Windows 1.0",
    "description": "This work was inspired by Vera Molnár's Computer rosace-series (1974) artwork. I put multiple rectangles to the grid and played with opacity to create a fading effect that increase closer to the middle of each rectangle to add more volume to the art piece."
  },

  {
    "file": "experiments/rect-var1.js",
    "name": "Geometric flowers 2.0",
    "description": "This work also uses rectangles and grid, but this time I added colors and rotation, making each rectangle seem like a geometric flower."
  },

  {
    "file": "experiments/rect-var2.js",
    "name": "Flower field 3.0",
    "description": "For this artwork, I made a grid of animated rectangles that change in size and switch colors over time."
  },

  {
    "file": "experiments/flowfield-var1.js",
    "name": "Pattern 1.0",
    "description": "Experimenting with flowfield"
  },

  {
    "file": "experiments/flowfield-var2.js",
    "name": "Pattern 2.0",
    "description": "Experimenting with flowfield"
  },

  {
    "file": "experiments/flowfield-var3.js",
    "name": "Pattern 3.0",
    "description": "TRY DRAWING HERE! For this work I added mouse control to be able to draw on canvas. I experimented with values to create patterns by drawing."
  },

  {
    "file": "experiments/sound1.js",
    "name": "Sound 1.0",
    "description": "......"
  }
]
